<script setup>
import SiteHeader from '../components/custom/SiteHeader.vue'
import ProfileMenu from '../components/custom/profile/ProfileMenu.vue'
import ProfileRecentView from '../components/custom/ProfileRecentView.vue'
import FavoriteElement from '../components/custom/FavoriteElement.vue'

import { Card } from '../components/ui/card'
import { Button } from '../components/ui/button'
import { Avatar, AvatarFallback, AvatarImage } from '@/components/ui/avatar'
import { Progress } from '@/components/ui/progress'
import { ScrollArea } from '@/components/ui/scroll-area'
import { Textarea } from '@/components/ui/textarea'
import { Tooltip, TooltipContent, TooltipProvider, TooltipTrigger } from '@/components/ui/tooltip'

import { Star, ChevronRight, Send } from 'lucide-vue-next'
</script>

<template>
  <div class="flex flex-col gap-8 max-h-full h-full p-16 box-border">
    <SiteHeader />
    <main class="flex overflow-y-auto h-full w-full gap-8 max-h-full">
      <ProfileMenu />
      <section class="flex w-full max-h-full h-full gap-6">
        <div class="flex flex-col w-full h-full gap-6">
          <!-- Заголовок лекции -->
          <div class="flex flex-col h-[72px] w-full gap-1">
            <Progress :model-value="33" class="h-1" />
            <div class="flex w-full justify-between">
              <h3 class="font-semibold text-xl">Уровни связности графов</h3>
              <TooltipProvider>
                <Tooltip>
                  <TooltipTrigger
                    ><Button variant="outline" size="icon" class="w-8 h-8 rounded-full"
                      ><Star size="16" /></Button
                  ></TooltipTrigger>
                  <TooltipContent>
                    <p>Добавить / убрать из Избранного</p>
                  </TooltipContent>
                </Tooltip>
              </TooltipProvider>
            </div>
            <p class="text-sm text-gray-400">Системный анализ</p>
          </div>
          <!-- Колонки -->
          <div class="flex grow gap-6 w-full overflow-hidden">
            <!-- Колонка 1 - текст лекции -->
            <ScrollArea class="flex w-full h-full text-lg">
              <p class="overflow-y-auto">
                Банальные, но неопровержимые выводы, а также независимые государства, превозмогая
                сложившуюся непростую экономическую ситуацию, ограничены исключительно образом
                мышления. Безусловно, курс на социально-ориентированный национальный проект требует
                определения и уточнения прогресса профессионального сообщества. Разнообразный и
                богатый опыт говорит нам, что синтетическое тестирование обеспечивает широкому кругу
                (специалистов) участие в формировании системы обучения кадров, соответствующей
                насущным потребностям. Но тщательные исследования конкурентов преданы
                социально-демократической анафеме. В частности, сложившаяся структура организации
                предопределяет высокую востребованность распределения внутренних резервов и
                ресурсов. В своём стремлении улучшить пользовательский опыт мы упускаем, что
                элементы политического процесса являются только методом политического участия и
                объединены в целые кластеры себе подобных. <br /><br />
                Вот вам яркий пример современных тенденций — постоянное
                информационно-пропагандистское обеспечение нашей деятельности способствует повышению
                качества вывода текущих активов. Мы вынуждены отталкиваться от того, что реализация
                намеченных плановых заданий не даёт нам иного выбора, кроме определения
                инновационных методов управления процессами. Мы вынуждены отталкиваться от того, что
                сложившаяся структура организации представляет собой интересный эксперимент проверки
                позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно
                упомянуто, элементы политического процесса формируют глобальную экономическую сеть и
                при этом — разоблачены. Таким образом, внедрение современных методик предопределяет
                высокую востребованность существующих финансовых и административных условий. Для
                современного мира начало повседневной работы по формированию позиции обеспечивает
                широкому кругу (специалистов) участие в формировании новых принципов формирования
                материально-технической и кадровой базы.<br /><br />
                В своём стремлении повысить качество жизни, они забывают, что реализация намеченных
                плановых заданий прекрасно подходит для реализации соответствующих условий
                активизации. Современные технологии достигли такого уровня, что перспективное
                планирование играет определяющее значение для анализа существующих паттернов
                поведения. Равным образом, выбранный нами инновационный путь прекрасно подходит для
                реализации прогресса профессионального сообщества. Являясь всего лишь частью общей
                картины, многие известные личности функционально разнесены на независимые элементы.
                Кстати, акционеры крупнейших компаний неоднозначны и будут рассмотрены исключительно
                в разрезе маркетинговых и финансовых предпосылок. Но высокое качество позиционных
                исследований, в своём классическом представлении, допускает внедрение
                глубокомысленных рассуждений! <br /><br />
                Лишь сделанные на базе интернет-аналитики выводы и по сей день остаются уделом
                либералов, которые жаждут быть призваны к ответу. Являясь всего лишь частью общей
                картины, представители современных социальных резервов, превозмогая сложившуюся
                непростую экономическую ситуацию, в равной степени предоставлены сами себе.
                Однозначно, многие известные личности, инициированные исключительно синтетически,
                смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего
                возрастает их статус бесполезности.<br /><br />
                Также как понимание сути ресурсосберегающих технологий играет важную роль в
                формировании соответствующих условий активизации. Учитывая ключевые сценарии
                поведения, выбранный нами инновационный путь позволяет оценить значение
                инновационных методов управления процессами. Лишь тщательные исследования
                конкурентов освещают чрезвычайно интересные особенности картины в целом, однако
                конкретные выводы, разумеется, ограничены исключительно образом мышления. Как уже
                неоднократно упомянуто, сторонники тоталитаризма в науке, которые представляют собой
                яркий пример континентально-европейского типа политической культуры, будут
                своевременно верифицированы. Принимая во внимание показатели успешности, дальнейшее
                развитие различных форм деятельности играет определяющее значение для переосмысления
                внешнеэкономических политик.<br /><br />
                В рамках спецификации современных стандартов, действия представителей оппозиции
                формируют глобальную экономическую сеть и при этом — обнародованы. В рамках
                спецификации современных стандартов, реплицированные с зарубежных источников,
                современные исследования указаны как претенденты на роль ключевых факторов.
                Банальные, но неопровержимые выводы, а также акционеры крупнейших компаний лишь
                добавляют фракционных разногласий и преданы социально-демократической анафеме. В
                частности, новая модель организационной деятельности требует определения и уточнения
                переосмысления внешнеэкономических политик.
              </p>
            </ScrollArea>
            <!-- Колонка 2 - чат -->
            <div
              class="flex flex-col basis-[360px] max-w-[360px] gap-2 w-full h-full max-h-full overflow-hidden"
            >
              <!-- Заголовок чата -->
              <div class="flex gap-2">
                <TooltipProvider>
                  <Tooltip>
                    <TooltipTrigger
                      ><Button variant="outline" size="icon" class="w-8 h-8 rounded-full"
                        ><ChevronRight size="16" /></Button
                    ></TooltipTrigger>
                    <TooltipContent>
                      <p>Свернуть</p>
                    </TooltipContent>
                  </Tooltip>
                </TooltipProvider>
                <h3 class="font-semibold text-xl">Чат</h3>
              </div>
              <!-- Панель ввода сообщения -->
              <div class="flex gap-2 items-start w-full">
                <TextArea
                  placeholder="Введите текст сообщения"
                  class="px-3 py-2 text-sm min-h-[80px] max-h-[240px] w-full"
                />
                <TooltipProvider>
                  <Tooltip>
                    <TooltipTrigger
                      ><Button variant="outline" size="icon" class="w-8 h-8 rounded-full"
                        ><Send size="16" /></Button
                    ></TooltipTrigger>
                    <TooltipContent>
                      <p>Отправить</p>
                    </TooltipContent>
                  </Tooltip>
                </TooltipProvider>
              </div>
              <ScrollArea class="overflow-hidden">
                <div class="flex flex-col grow h-full gap-2">
                  <!-- Сообщение пользователя -->
                  <Card class="flex gap-4 p-4">
                    <Avatar>
                      <AvatarImage src="" alt="Ваш аватар" />
                      <AvatarFallback>CN</AvatarFallback>
                    </Avatar>
                    <div class="flex gap-1 flex-col text-sm">
                      <div class="flex justify-between">
                        <p class="font-bold">Вы</p>
                        <p class="text-gray-500">12-03-2024 15:30</p>
                      </div>
                      <p>
                        Банальные, но неопровержимые выводы, а также диаграммы связей формируют
                        глобальную экономическую сеть и при этом — заблокированы в рамках своих
                        собственных рациональных ограничений. Принимая во внимание показатели
                        успешности, укрепление и развитие внутренней структуры однозначно определяет
                        каждого участника как способного принимать собственные решения касаемо
                        поставленных обществом задач. Идейные соображения высшего порядка, а также
                        высокое качество позиционных исследований создаёт предпосылки для
                        глубокомысленных рассуждений.
                      </p>
                    </div>
                  </Card>
                  <!-- Сообщение ИИ -->
                  <Card class="flex gap-4 p-4">
                    <div class="flex gap-1 flex-col text-sm">
                      <div class="flex justify-between">
                        <p class="font-bold">Вы</p>
                        <p class="text-gray-500">12-03-2024 15:30</p>
                      </div>
                      <p>
                        Банальные, но неопровержимые выводы, а также диаграммы связей формируют
                        глобальную экономическую сеть и при этом — заблокированы в рамках своих
                        собственных рациональных ограничений. Принимая во внимание показатели
                        успешности, укрепление и развитие внутренней структуры однозначно определяет
                        каждого участника как способного принимать собственные решения касаемо
                        поставленных обществом задач. Идейные соображения высшего порядка, а также
                        высокое качество позиционных исследований создаёт предпосылки для
                        глубокомысленных рассуждений.
                      </p>
                    </div>
                    <Avatar class="bg-blue-900 text-gray-100">
                      <AvatarImage src="" alt="Ваш аватар" />
                      <AvatarFallback>AI</AvatarFallback>
                    </Avatar>
                  </Card>
                </div>
              </ScrollArea>
            </div>
          </div>
        </div>
      </section>
    </main>
  </div>
</template>
